espressif/esp-idf/components/soc/esp32h4/register/soc/lp_tee_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_TEE_TRNG_CTRL_REG register
 *  trng read/write control register
 */
#define LP_TEE_TRNG_CTRL_REG (DR_REG_LP_TEE_BASE + 0x0)
/** LP_TEE_READ_TEE_TRNG : R/W; bitpos: [0]; default: 1;
 *  Configures trng registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_TRNG    (BIT(0))
#define LP_TEE_READ_TEE_TRNG_M  (LP_TEE_READ_TEE_TRNG_V << LP_TEE_READ_TEE_TRNG_S)
#define LP_TEE_READ_TEE_TRNG_V  0x00000001U
#define LP_TEE_READ_TEE_TRNG_S  0
/** LP_TEE_READ_REE0_TRNG : R/W; bitpos: [1]; default: 0;
 *  Configures trng registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_TRNG    (BIT(1))
#define LP_TEE_READ_REE0_TRNG_M  (LP_TEE_READ_REE0_TRNG_V << LP_TEE_READ_REE0_TRNG_S)
#define LP_TEE_READ_REE0_TRNG_V  0x00000001U
#define LP_TEE_READ_REE0_TRNG_S  1
/** LP_TEE_READ_REE1_TRNG : R/W; bitpos: [2]; default: 0;
 *  Configures trng registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_TRNG    (BIT(2))
#define LP_TEE_READ_REE1_TRNG_M  (LP_TEE_READ_REE1_TRNG_V << LP_TEE_READ_REE1_TRNG_S)
#define LP_TEE_READ_REE1_TRNG_V  0x00000001U
#define LP_TEE_READ_REE1_TRNG_S  2
/** LP_TEE_READ_REE2_TRNG : R/W; bitpos: [3]; default: 0;
 *  Configures trng registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_TRNG    (BIT(3))
#define LP_TEE_READ_REE2_TRNG_M  (LP_TEE_READ_REE2_TRNG_V << LP_TEE_READ_REE2_TRNG_S)
#define LP_TEE_READ_REE2_TRNG_V  0x00000001U
#define LP_TEE_READ_REE2_TRNG_S  3
/** LP_TEE_WRITE_TEE_TRNG : R/W; bitpos: [4]; default: 1;
 *  Configures trng registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_TRNG    (BIT(4))
#define LP_TEE_WRITE_TEE_TRNG_M  (LP_TEE_WRITE_TEE_TRNG_V << LP_TEE_WRITE_TEE_TRNG_S)
#define LP_TEE_WRITE_TEE_TRNG_V  0x00000001U
#define LP_TEE_WRITE_TEE_TRNG_S  4
/** LP_TEE_WRITE_REE0_TRNG : R/W; bitpos: [5]; default: 0;
 *  Configures trng registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_TRNG    (BIT(5))
#define LP_TEE_WRITE_REE0_TRNG_M  (LP_TEE_WRITE_REE0_TRNG_V << LP_TEE_WRITE_REE0_TRNG_S)
#define LP_TEE_WRITE_REE0_TRNG_V  0x00000001U
#define LP_TEE_WRITE_REE0_TRNG_S  5
/** LP_TEE_WRITE_REE1_TRNG : R/W; bitpos: [6]; default: 0;
 *  Configures trng registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_TRNG    (BIT(6))
#define LP_TEE_WRITE_REE1_TRNG_M  (LP_TEE_WRITE_REE1_TRNG_V << LP_TEE_WRITE_REE1_TRNG_S)
#define LP_TEE_WRITE_REE1_TRNG_V  0x00000001U
#define LP_TEE_WRITE_REE1_TRNG_S  6
/** LP_TEE_WRITE_REE2_TRNG : R/W; bitpos: [7]; default: 0;
 *  Configures trng registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_TRNG    (BIT(7))
#define LP_TEE_WRITE_REE2_TRNG_M  (LP_TEE_WRITE_REE2_TRNG_V << LP_TEE_WRITE_REE2_TRNG_S)
#define LP_TEE_WRITE_REE2_TRNG_V  0x00000001U
#define LP_TEE_WRITE_REE2_TRNG_S  7

/** LP_TEE_EFUSE_CTRL_REG register
 *  efuse read/write control register
 */
#define LP_TEE_EFUSE_CTRL_REG (DR_REG_LP_TEE_BASE + 0x4)
/** LP_TEE_READ_TEE_EFUSE : R/W; bitpos: [0]; default: 1;
 *  Configures efuse registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_EFUSE    (BIT(0))
#define LP_TEE_READ_TEE_EFUSE_M  (LP_TEE_READ_TEE_EFUSE_V << LP_TEE_READ_TEE_EFUSE_S)
#define LP_TEE_READ_TEE_EFUSE_V  0x00000001U
#define LP_TEE_READ_TEE_EFUSE_S  0
/** LP_TEE_READ_REE0_EFUSE : R/W; bitpos: [1]; default: 0;
 *  Configures efuse registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_EFUSE    (BIT(1))
#define LP_TEE_READ_REE0_EFUSE_M  (LP_TEE_READ_REE0_EFUSE_V << LP_TEE_READ_REE0_EFUSE_S)
#define LP_TEE_READ_REE0_EFUSE_V  0x00000001U
#define LP_TEE_READ_REE0_EFUSE_S  1
/** LP_TEE_READ_REE1_EFUSE : R/W; bitpos: [2]; default: 0;
 *  Configures efuse registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_EFUSE    (BIT(2))
#define LP_TEE_READ_REE1_EFUSE_M  (LP_TEE_READ_REE1_EFUSE_V << LP_TEE_READ_REE1_EFUSE_S)
#define LP_TEE_READ_REE1_EFUSE_V  0x00000001U
#define LP_TEE_READ_REE1_EFUSE_S  2
/** LP_TEE_READ_REE2_EFUSE : R/W; bitpos: [3]; default: 0;
 *  Configures efuse registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_EFUSE    (BIT(3))
#define LP_TEE_READ_REE2_EFUSE_M  (LP_TEE_READ_REE2_EFUSE_V << LP_TEE_READ_REE2_EFUSE_S)
#define LP_TEE_READ_REE2_EFUSE_V  0x00000001U
#define LP_TEE_READ_REE2_EFUSE_S  3
/** LP_TEE_WRITE_TEE_EFUSE : R/W; bitpos: [4]; default: 1;
 *  Configures efuse registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_EFUSE    (BIT(4))
#define LP_TEE_WRITE_TEE_EFUSE_M  (LP_TEE_WRITE_TEE_EFUSE_V << LP_TEE_WRITE_TEE_EFUSE_S)
#define LP_TEE_WRITE_TEE_EFUSE_V  0x00000001U
#define LP_TEE_WRITE_TEE_EFUSE_S  4
/** LP_TEE_WRITE_REE0_EFUSE : R/W; bitpos: [5]; default: 0;
 *  Configures efuse registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_EFUSE    (BIT(5))
#define LP_TEE_WRITE_REE0_EFUSE_M  (LP_TEE_WRITE_REE0_EFUSE_V << LP_TEE_WRITE_REE0_EFUSE_S)
#define LP_TEE_WRITE_REE0_EFUSE_V  0x00000001U
#define LP_TEE_WRITE_REE0_EFUSE_S  5
/** LP_TEE_WRITE_REE1_EFUSE : R/W; bitpos: [6]; default: 0;
 *  Configures efuse registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_EFUSE    (BIT(6))
#define LP_TEE_WRITE_REE1_EFUSE_M  (LP_TEE_WRITE_REE1_EFUSE_V << LP_TEE_WRITE_REE1_EFUSE_S)
#define LP_TEE_WRITE_REE1_EFUSE_V  0x00000001U
#define LP_TEE_WRITE_REE1_EFUSE_S  6
/** LP_TEE_WRITE_REE2_EFUSE : R/W; bitpos: [7]; default: 0;
 *  Configures efuse registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_EFUSE    (BIT(7))
#define LP_TEE_WRITE_REE2_EFUSE_M  (LP_TEE_WRITE_REE2_EFUSE_V << LP_TEE_WRITE_REE2_EFUSE_S)
#define LP_TEE_WRITE_REE2_EFUSE_V  0x00000001U
#define LP_TEE_WRITE_REE2_EFUSE_S  7

/** LP_TEE_PMU_CTRL_REG register
 *  pmu read/write control register
 */
#define LP_TEE_PMU_CTRL_REG (DR_REG_LP_TEE_BASE + 0x8)
/** LP_TEE_READ_TEE_PMU : R/W; bitpos: [0]; default: 1;
 *  Configures pmu registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_PMU    (BIT(0))
#define LP_TEE_READ_TEE_PMU_M  (LP_TEE_READ_TEE_PMU_V << LP_TEE_READ_TEE_PMU_S)
#define LP_TEE_READ_TEE_PMU_V  0x00000001U
#define LP_TEE_READ_TEE_PMU_S  0
/** LP_TEE_READ_REE0_PMU : R/W; bitpos: [1]; default: 0;
 *  Configures pmu registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_PMU    (BIT(1))
#define LP_TEE_READ_REE0_PMU_M  (LP_TEE_READ_REE0_PMU_V << LP_TEE_READ_REE0_PMU_S)
#define LP_TEE_READ_REE0_PMU_V  0x00000001U
#define LP_TEE_READ_REE0_PMU_S  1
/** LP_TEE_READ_REE1_PMU : R/W; bitpos: [2]; default: 0;
 *  Configures pmu registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_PMU    (BIT(2))
#define LP_TEE_READ_REE1_PMU_M  (LP_TEE_READ_REE1_PMU_V << LP_TEE_READ_REE1_PMU_S)
#define LP_TEE_READ_REE1_PMU_V  0x00000001U
#define LP_TEE_READ_REE1_PMU_S  2
/** LP_TEE_READ_REE2_PMU : R/W; bitpos: [3]; default: 0;
 *  Configures pmu registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_PMU    (BIT(3))
#define LP_TEE_READ_REE2_PMU_M  (LP_TEE_READ_REE2_PMU_V << LP_TEE_READ_REE2_PMU_S)
#define LP_TEE_READ_REE2_PMU_V  0x00000001U
#define LP_TEE_READ_REE2_PMU_S  3
/** LP_TEE_WRITE_TEE_PMU : R/W; bitpos: [4]; default: 1;
 *  Configures pmu registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_PMU    (BIT(4))
#define LP_TEE_WRITE_TEE_PMU_M  (LP_TEE_WRITE_TEE_PMU_V << LP_TEE_WRITE_TEE_PMU_S)
#define LP_TEE_WRITE_TEE_PMU_V  0x00000001U
#define LP_TEE_WRITE_TEE_PMU_S  4
/** LP_TEE_WRITE_REE0_PMU : R/W; bitpos: [5]; default: 0;
 *  Configures pmu registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_PMU    (BIT(5))
#define LP_TEE_WRITE_REE0_PMU_M  (LP_TEE_WRITE_REE0_PMU_V << LP_TEE_WRITE_REE0_PMU_S)
#define LP_TEE_WRITE_REE0_PMU_V  0x00000001U
#define LP_TEE_WRITE_REE0_PMU_S  5
/** LP_TEE_WRITE_REE1_PMU : R/W; bitpos: [6]; default: 0;
 *  Configures pmu registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_PMU    (BIT(6))
#define LP_TEE_WRITE_REE1_PMU_M  (LP_TEE_WRITE_REE1_PMU_V << LP_TEE_WRITE_REE1_PMU_S)
#define LP_TEE_WRITE_REE1_PMU_V  0x00000001U
#define LP_TEE_WRITE_REE1_PMU_S  6
/** LP_TEE_WRITE_REE2_PMU : R/W; bitpos: [7]; default: 0;
 *  Configures pmu registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_PMU    (BIT(7))
#define LP_TEE_WRITE_REE2_PMU_M  (LP_TEE_WRITE_REE2_PMU_V << LP_TEE_WRITE_REE2_PMU_S)
#define LP_TEE_WRITE_REE2_PMU_V  0x00000001U
#define LP_TEE_WRITE_REE2_PMU_S  7

