espressif/esp-idf/components/soc/esp32h4/register/soc/lp_tee_reg.h
/** LP_TEE_CLKRST_CTRL_REG register
 *  clkrst read/write control register
 */
#define LP_TEE_CLKRST_CTRL_REG (DR_REG_LP_TEE_BASE + 0xc)
/** LP_TEE_READ_TEE_CLKRST : R/W; bitpos: [0]; default: 1;
 *  Configures clkrst registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_CLKRST    (BIT(0))
#define LP_TEE_READ_TEE_CLKRST_M  (LP_TEE_READ_TEE_CLKRST_V << LP_TEE_READ_TEE_CLKRST_S)
#define LP_TEE_READ_TEE_CLKRST_V  0x00000001U
#define LP_TEE_READ_TEE_CLKRST_S  0
/** LP_TEE_READ_REE0_CLKRST : R/W; bitpos: [1]; default: 0;
 *  Configures clkrst registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_CLKRST    (BIT(1))
#define LP_TEE_READ_REE0_CLKRST_M  (LP_TEE_READ_REE0_CLKRST_V << LP_TEE_READ_REE0_CLKRST_S)
#define LP_TEE_READ_REE0_CLKRST_V  0x00000001U
#define LP_TEE_READ_REE0_CLKRST_S  1
/** LP_TEE_READ_REE1_CLKRST : R/W; bitpos: [2]; default: 0;
 *  Configures clkrst registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_CLKRST    (BIT(2))
#define LP_TEE_READ_REE1_CLKRST_M  (LP_TEE_READ_REE1_CLKRST_V << LP_TEE_READ_REE1_CLKRST_S)
#define LP_TEE_READ_REE1_CLKRST_V  0x00000001U
#define LP_TEE_READ_REE1_CLKRST_S  2
/** LP_TEE_READ_REE2_CLKRST : R/W; bitpos: [3]; default: 0;
 *  Configures clkrst registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_CLKRST    (BIT(3))
#define LP_TEE_READ_REE2_CLKRST_M  (LP_TEE_READ_REE2_CLKRST_V << LP_TEE_READ_REE2_CLKRST_S)
#define LP_TEE_READ_REE2_CLKRST_V  0x00000001U
#define LP_TEE_READ_REE2_CLKRST_S  3
/** LP_TEE_WRITE_TEE_CLKRST : R/W; bitpos: [4]; default: 1;
 *  Configures clkrst registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_CLKRST    (BIT(4))
#define LP_TEE_WRITE_TEE_CLKRST_M  (LP_TEE_WRITE_TEE_CLKRST_V << LP_TEE_WRITE_TEE_CLKRST_S)
#define LP_TEE_WRITE_TEE_CLKRST_V  0x00000001U
#define LP_TEE_WRITE_TEE_CLKRST_S  4
/** LP_TEE_WRITE_REE0_CLKRST : R/W; bitpos: [5]; default: 0;
 *  Configures clkrst registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_CLKRST    (BIT(5))
#define LP_TEE_WRITE_REE0_CLKRST_M  (LP_TEE_WRITE_REE0_CLKRST_V << LP_TEE_WRITE_REE0_CLKRST_S)
#define LP_TEE_WRITE_REE0_CLKRST_V  0x00000001U
#define LP_TEE_WRITE_REE0_CLKRST_S  5
/** LP_TEE_WRITE_REE1_CLKRST : R/W; bitpos: [6]; default: 0;
 *  Configures clkrst registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_CLKRST    (BIT(6))
#define LP_TEE_WRITE_REE1_CLKRST_M  (LP_TEE_WRITE_REE1_CLKRST_V << LP_TEE_WRITE_REE1_CLKRST_S)
#define LP_TEE_WRITE_REE1_CLKRST_V  0x00000001U
#define LP_TEE_WRITE_REE1_CLKRST_S  6
/** LP_TEE_WRITE_REE2_CLKRST : R/W; bitpos: [7]; default: 0;
 *  Configures clkrst registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_CLKRST    (BIT(7))
#define LP_TEE_WRITE_REE2_CLKRST_M  (LP_TEE_WRITE_REE2_CLKRST_V << LP_TEE_WRITE_REE2_CLKRST_S)
#define LP_TEE_WRITE_REE2_CLKRST_V  0x00000001U
#define LP_TEE_WRITE_REE2_CLKRST_S  7

/** LP_TEE_LP_AON_CTRL_CTRL_REG register
 *  lp_aon_ctrl read/write control register
 */
#define LP_TEE_LP_AON_CTRL_CTRL_REG (DR_REG_LP_TEE_BASE + 0x10)
/** LP_TEE_READ_TEE_LP_AON_CTRL : R/W; bitpos: [0]; default: 1;
 *  Configures lp_aon_ctrl registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_LP_AON_CTRL    (BIT(0))
#define LP_TEE_READ_TEE_LP_AON_CTRL_M  (LP_TEE_READ_TEE_LP_AON_CTRL_V << LP_TEE_READ_TEE_LP_AON_CTRL_S)
#define LP_TEE_READ_TEE_LP_AON_CTRL_V  0x00000001U
#define LP_TEE_READ_TEE_LP_AON_CTRL_S  0
/** LP_TEE_READ_REE0_LP_AON_CTRL : R/W; bitpos: [1]; default: 0;
 *  Configures lp_aon_ctrl registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_LP_AON_CTRL    (BIT(1))
#define LP_TEE_READ_REE0_LP_AON_CTRL_M  (LP_TEE_READ_REE0_LP_AON_CTRL_V << LP_TEE_READ_REE0_LP_AON_CTRL_S)
#define LP_TEE_READ_REE0_LP_AON_CTRL_V  0x00000001U
#define LP_TEE_READ_REE0_LP_AON_CTRL_S  1
/** LP_TEE_READ_REE1_LP_AON_CTRL : R/W; bitpos: [2]; default: 0;
 *  Configures lp_aon_ctrl registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_LP_AON_CTRL    (BIT(2))
#define LP_TEE_READ_REE1_LP_AON_CTRL_M  (LP_TEE_READ_REE1_LP_AON_CTRL_V << LP_TEE_READ_REE1_LP_AON_CTRL_S)
#define LP_TEE_READ_REE1_LP_AON_CTRL_V  0x00000001U
#define LP_TEE_READ_REE1_LP_AON_CTRL_S  2
/** LP_TEE_READ_REE2_LP_AON_CTRL : R/W; bitpos: [3]; default: 0;
 *  Configures lp_aon_ctrl registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_LP_AON_CTRL    (BIT(3))
#define LP_TEE_READ_REE2_LP_AON_CTRL_M  (LP_TEE_READ_REE2_LP_AON_CTRL_V << LP_TEE_READ_REE2_LP_AON_CTRL_S)
#define LP_TEE_READ_REE2_LP_AON_CTRL_V  0x00000001U
#define LP_TEE_READ_REE2_LP_AON_CTRL_S  3
/** LP_TEE_WRITE_TEE_LP_AON_CTRL : R/W; bitpos: [4]; default: 1;
 *  Configures lp_aon_ctrl registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_LP_AON_CTRL    (BIT(4))
#define LP_TEE_WRITE_TEE_LP_AON_CTRL_M  (LP_TEE_WRITE_TEE_LP_AON_CTRL_V << LP_TEE_WRITE_TEE_LP_AON_CTRL_S)
#define LP_TEE_WRITE_TEE_LP_AON_CTRL_V  0x00000001U
#define LP_TEE_WRITE_TEE_LP_AON_CTRL_S  4
/** LP_TEE_WRITE_REE0_LP_AON_CTRL : R/W; bitpos: [5]; default: 0;
 *  Configures lp_aon_ctrl registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_LP_AON_CTRL    (BIT(5))
#define LP_TEE_WRITE_REE0_LP_AON_CTRL_M  (LP_TEE_WRITE_REE0_LP_AON_CTRL_V << LP_TEE_WRITE_REE0_LP_AON_CTRL_S)
#define LP_TEE_WRITE_REE0_LP_AON_CTRL_V  0x00000001U
#define LP_TEE_WRITE_REE0_LP_AON_CTRL_S  5
/** LP_TEE_WRITE_REE1_LP_AON_CTRL : R/W; bitpos: [6]; default: 0;
 *  Configures lp_aon_ctrl registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_LP_AON_CTRL    (BIT(6))
#define LP_TEE_WRITE_REE1_LP_AON_CTRL_M  (LP_TEE_WRITE_REE1_LP_AON_CTRL_V << LP_TEE_WRITE_REE1_LP_AON_CTRL_S)
#define LP_TEE_WRITE_REE1_LP_AON_CTRL_V  0x00000001U
#define LP_TEE_WRITE_REE1_LP_AON_CTRL_S  6
/** LP_TEE_WRITE_REE2_LP_AON_CTRL : R/W; bitpos: [7]; default: 0;
 *  Configures lp_aon_ctrl registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_LP_AON_CTRL    (BIT(7))
#define LP_TEE_WRITE_REE2_LP_AON_CTRL_M  (LP_TEE_WRITE_REE2_LP_AON_CTRL_V << LP_TEE_WRITE_REE2_LP_AON_CTRL_S)
#define LP_TEE_WRITE_REE2_LP_AON_CTRL_V  0x00000001U
#define LP_TEE_WRITE_REE2_LP_AON_CTRL_S  7

/** LP_TEE_LP_TIMER_CTRL_REG register
 *  lp_timer read/write control register
 */
#define LP_TEE_LP_TIMER_CTRL_REG (DR_REG_LP_TEE_BASE + 0x14)
/** LP_TEE_READ_TEE_LP_TIMER : R/W; bitpos: [0]; default: 1;
 *  Configures lp_timer registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_LP_TIMER    (BIT(0))
#define LP_TEE_READ_TEE_LP_TIMER_M  (LP_TEE_READ_TEE_LP_TIMER_V << LP_TEE_READ_TEE_LP_TIMER_S)
#define LP_TEE_READ_TEE_LP_TIMER_V  0x00000001U
#define LP_TEE_READ_TEE_LP_TIMER_S  0
/** LP_TEE_READ_REE0_LP_TIMER : R/W; bitpos: [1]; default: 0;
 *  Configures lp_timer registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_LP_TIMER    (BIT(1))
#define LP_TEE_READ_REE0_LP_TIMER_M  (LP_TEE_READ_REE0_LP_TIMER_V << LP_TEE_READ_REE0_LP_TIMER_S)
#define LP_TEE_READ_REE0_LP_TIMER_V  0x00000001U
#define LP_TEE_READ_REE0_LP_TIMER_S  1
/** LP_TEE_READ_REE1_LP_TIMER : R/W; bitpos: [2]; default: 0;
 *  Configures lp_timer registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_LP_TIMER    (BIT(2))
#define LP_TEE_READ_REE1_LP_TIMER_M  (LP_TEE_READ_REE1_LP_TIMER_V << LP_TEE_READ_REE1_LP_TIMER_S)
#define LP_TEE_READ_REE1_LP_TIMER_V  0x00000001U
#define LP_TEE_READ_REE1_LP_TIMER_S  2
/** LP_TEE_READ_REE2_LP_TIMER : R/W; bitpos: [3]; default: 0;
 *  Configures lp_timer registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_LP_TIMER    (BIT(3))
#define LP_TEE_READ_REE2_LP_TIMER_M  (LP_TEE_READ_REE2_LP_TIMER_V << LP_TEE_READ_REE2_LP_TIMER_S)
#define LP_TEE_READ_REE2_LP_TIMER_V  0x00000001U
#define LP_TEE_READ_REE2_LP_TIMER_S  3
/** LP_TEE_WRITE_TEE_LP_TIMER : R/W; bitpos: [4]; default: 1;
 *  Configures lp_timer registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_LP_TIMER    (BIT(4))
#define LP_TEE_WRITE_TEE_LP_TIMER_M  (LP_TEE_WRITE_TEE_LP_TIMER_V << LP_TEE_WRITE_TEE_LP_TIMER_S)
#define LP_TEE_WRITE_TEE_LP_TIMER_V  0x00000001U
#define LP_TEE_WRITE_TEE_LP_TIMER_S  4
/** LP_TEE_WRITE_REE0_LP_TIMER : R/W; bitpos: [5]; default: 0;
 *  Configures lp_timer registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_LP_TIMER    (BIT(5))
#define LP_TEE_WRITE_REE0_LP_TIMER_M  (LP_TEE_WRITE_REE0_LP_TIMER_V << LP_TEE_WRITE_REE0_LP_TIMER_S)
#define LP_TEE_WRITE_REE0_LP_TIMER_V  0x00000001U
#define LP_TEE_WRITE_REE0_LP_TIMER_S  5
/** LP_TEE_WRITE_REE1_LP_TIMER : R/W; bitpos: [6]; default: 0;
 *  Configures lp_timer registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_LP_TIMER    (BIT(6))
#define LP_TEE_WRITE_REE1_LP_TIMER_M  (LP_TEE_WRITE_REE1_LP_TIMER_V << LP_TEE_WRITE_REE1_LP_TIMER_S)
#define LP_TEE_WRITE_REE1_LP_TIMER_V  0x00000001U
#define LP_TEE_WRITE_REE1_LP_TIMER_S  6
/** LP_TEE_WRITE_REE2_LP_TIMER : R/W; bitpos: [7]; default: 0;
 *  Configures lp_timer registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_LP_TIMER    (BIT(7))
#define LP_TEE_WRITE_REE2_LP_TIMER_M  (LP_TEE_WRITE_REE2_LP_TIMER_V << LP_TEE_WRITE_REE2_LP_TIMER_S)
#define LP_TEE_WRITE_REE2_LP_TIMER_V  0x00000001U
#define LP_TEE_WRITE_REE2_LP_TIMER_S  7

/** LP_TEE_LP_WDT_CTRL_REG register
 *  lp_wdt read/write control register
 */
#define LP_TEE_LP_WDT_CTRL_REG (DR_REG_LP_TEE_BASE + 0x18)
/** LP_TEE_READ_TEE_LP_WDT : R/W; bitpos: [0]; default: 1;
 *  Configures lp_wdt registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_LP_WDT    (BIT(0))
#define LP_TEE_READ_TEE_LP_WDT_M  (LP_TEE_READ_TEE_LP_WDT_V << LP_TEE_READ_TEE_LP_WDT_S)
#define LP_TEE_READ_TEE_LP_WDT_V  0x00000001U
#define LP_TEE_READ_TEE_LP_WDT_S  0
/** LP_TEE_READ_REE0_LP_WDT : R/W; bitpos: [1]; default: 0;
 *  Configures lp_wdt registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_LP_WDT    (BIT(1))
#define LP_TEE_READ_REE0_LP_WDT_M  (LP_TEE_READ_REE0_LP_WDT_V << LP_TEE_READ_REE0_LP_WDT_S)
#define LP_TEE_READ_REE0_LP_WDT_V  0x00000001U
#define LP_TEE_READ_REE0_LP_WDT_S  1
/** LP_TEE_READ_REE1_LP_WDT : R/W; bitpos: [2]; default: 0;
 *  Configures lp_wdt registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_LP_WDT    (BIT(2))
#define LP_TEE_READ_REE1_LP_WDT_M  (LP_TEE_READ_REE1_LP_WDT_V << LP_TEE_READ_REE1_LP_WDT_S)
#define LP_TEE_READ_REE1_LP_WDT_V  0x00000001U
#define LP_TEE_READ_REE1_LP_WDT_S  2
/** LP_TEE_READ_REE2_LP_WDT : R/W; bitpos: [3]; default: 0;
 *  Configures lp_wdt registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_LP_WDT    (BIT(3))
#define LP_TEE_READ_REE2_LP_WDT_M  (LP_TEE_READ_REE2_LP_WDT_V << LP_TEE_READ_REE2_LP_WDT_S)
#define LP_TEE_READ_REE2_LP_WDT_V  0x00000001U
#define LP_TEE_READ_REE2_LP_WDT_S  3
/** LP_TEE_WRITE_TEE_LP_WDT : R/W; bitpos: [4]; default: 1;
 *  Configures lp_wdt registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_LP_WDT    (BIT(4))
#define LP_TEE_WRITE_TEE_LP_WDT_M  (LP_TEE_WRITE_TEE_LP_WDT_V << LP_TEE_WRITE_TEE_LP_WDT_S)
#define LP_TEE_WRITE_TEE_LP_WDT_V  0x00000001U
#define LP_TEE_WRITE_TEE_LP_WDT_S  4
/** LP_TEE_WRITE_REE0_LP_WDT : R/W; bitpos: [5]; default: 0;
 *  Configures lp_wdt registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_LP_WDT    (BIT(5))
#define LP_TEE_WRITE_REE0_LP_WDT_M  (LP_TEE_WRITE_REE0_LP_WDT_V << LP_TEE_WRITE_REE0_LP_WDT_S)
#define LP_TEE_WRITE_REE0_LP_WDT_V  0x00000001U
#define LP_TEE_WRITE_REE0_LP_WDT_S  5
/** LP_TEE_WRITE_REE1_LP_WDT : R/W; bitpos: [6]; default: 0;
 *  Configures lp_wdt registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_LP_WDT    (BIT(6))
#define LP_TEE_WRITE_REE1_LP_WDT_M  (LP_TEE_WRITE_REE1_LP_WDT_V << LP_TEE_WRITE_REE1_LP_WDT_S)
#define LP_TEE_WRITE_REE1_LP_WDT_V  0x00000001U
#define LP_TEE_WRITE_REE1_LP_WDT_S  6
/** LP_TEE_WRITE_REE2_LP_WDT : R/W; bitpos: [7]; default: 0;
 *  Configures lp_wdt registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_LP_WDT    (BIT(7))
#define LP_TEE_WRITE_REE2_LP_WDT_M  (LP_TEE_WRITE_REE2_LP_WDT_V << LP_TEE_WRITE_REE2_LP_WDT_S)
#define LP_TEE_WRITE_REE2_LP_WDT_V  0x00000001U
#define LP_TEE_WRITE_REE2_LP_WDT_S  7

/** LP_TEE_LPPERI_CTRL_REG register
 *  lpperi read/write control register
 */
#define LP_TEE_LPPERI_CTRL_REG (DR_REG_LP_TEE_BASE + 0x1c)
/** LP_TEE_READ_TEE_LPPERI : R/W; bitpos: [0]; default: 1;
 *  Configures lpperi registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_LPPERI    (BIT(0))
#define LP_TEE_READ_TEE_LPPERI_M  (LP_TEE_READ_TEE_LPPERI_V << LP_TEE_READ_TEE_LPPERI_S)
#define LP_TEE_READ_TEE_LPPERI_V  0x00000001U
#define LP_TEE_READ_TEE_LPPERI_S  0
/** LP_TEE_READ_REE0_LPPERI : R/W; bitpos: [1]; default: 0;
 *  Configures lpperi registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_LPPERI    (BIT(1))
#define LP_TEE_READ_REE0_LPPERI_M  (LP_TEE_READ_REE0_LPPERI_V << LP_TEE_READ_REE0_LPPERI_S)
#define LP_TEE_READ_REE0_LPPERI_V  0x00000001U
#define LP_TEE_READ_REE0_LPPERI_S  1
/** LP_TEE_READ_REE1_LPPERI : R/W; bitpos: [2]; default: 0;
 *  Configures lpperi registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_LPPERI    (BIT(2))
#define LP_TEE_READ_REE1_LPPERI_M  (LP_TEE_READ_REE1_LPPERI_V << LP_TEE_READ_REE1_LPPERI_S)
#define LP_TEE_READ_REE1_LPPERI_V  0x00000001U
#define LP_TEE_READ_REE1_LPPERI_S  2
/** LP_TEE_READ_REE2_LPPERI : R/W; bitpos: [3]; default: 0;
 *  Configures lpperi registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_LPPERI    (BIT(3))
#define LP_TEE_READ_REE2_LPPERI_M  (LP_TEE_READ_REE2_LPPERI_V << LP_TEE_READ_REE2_LPPERI_S)
#define LP_TEE_READ_REE2_LPPERI_V  0x00000001U
#define LP_TEE_READ_REE2_LPPERI_S  3
/** LP_TEE_WRITE_TEE_LPPERI : R/W; bitpos: [4]; default: 1;
 *  Configures lpperi registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_LPPERI    (BIT(4))
#define LP_TEE_WRITE_TEE_LPPERI_M  (LP_TEE_WRITE_TEE_LPPERI_V << LP_TEE_WRITE_TEE_LPPERI_S)
#define LP_TEE_WRITE_TEE_LPPERI_V  0x00000001U
#define LP_TEE_WRITE_TEE_LPPERI_S  4
/** LP_TEE_WRITE_REE0_LPPERI : R/W; bitpos: [5]; default: 0;
 *  Configures lpperi registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_LPPERI    (BIT(5))
#define LP_TEE_WRITE_REE0_LPPERI_M  (LP_TEE_WRITE_REE0_LPPERI_V << LP_TEE_WRITE_REE0_LPPERI_S)
#define LP_TEE_WRITE_REE0_LPPERI_V  0x00000001U
#define LP_TEE_WRITE_REE0_LPPERI_S  5
/** LP_TEE_WRITE_REE1_LPPERI : R/W; bitpos: [6]; default: 0;
 *  Configures lpperi registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_LPPERI    (BIT(6))
#define LP_TEE_WRITE_REE1_LPPERI_M  (LP_TEE_WRITE_REE1_LPPERI_V << LP_TEE_WRITE_REE1_LPPERI_S)
#define LP_TEE_WRITE_REE1_LPPERI_V  0x00000001U
#define LP_TEE_WRITE_REE1_LPPERI_S  6
/** LP_TEE_WRITE_REE2_LPPERI : R/W; bitpos: [7]; default: 0;
 *  Configures lpperi registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_LPPERI    (BIT(7))
#define LP_TEE_WRITE_REE2_LPPERI_M  (LP_TEE_WRITE_REE2_LPPERI_V << LP_TEE_WRITE_REE2_LPPERI_S)
#define LP_TEE_WRITE_REE2_LPPERI_V  0x00000001U
#define LP_TEE_WRITE_REE2_LPPERI_S  7

