espressif/esp-idf/components/soc/esp32h4/register/soc/lp_tee_reg.h
/** LP_TEE_LP_ANA_PERI_CTRL_REG register
 *  lp_ana_peri read/write control register
 */
#define LP_TEE_LP_ANA_PERI_CTRL_REG (DR_REG_LP_TEE_BASE + 0x20)
/** LP_TEE_READ_TEE_LP_ANA_PERI : R/W; bitpos: [0]; default: 1;
 *  Configures lp_ana_peri registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_LP_ANA_PERI    (BIT(0))
#define LP_TEE_READ_TEE_LP_ANA_PERI_M  (LP_TEE_READ_TEE_LP_ANA_PERI_V << LP_TEE_READ_TEE_LP_ANA_PERI_S)
#define LP_TEE_READ_TEE_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_READ_TEE_LP_ANA_PERI_S  0
/** LP_TEE_READ_REE0_LP_ANA_PERI : R/W; bitpos: [1]; default: 0;
 *  Configures lp_ana_peri registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_LP_ANA_PERI    (BIT(1))
#define LP_TEE_READ_REE0_LP_ANA_PERI_M  (LP_TEE_READ_REE0_LP_ANA_PERI_V << LP_TEE_READ_REE0_LP_ANA_PERI_S)
#define LP_TEE_READ_REE0_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_READ_REE0_LP_ANA_PERI_S  1
/** LP_TEE_READ_REE1_LP_ANA_PERI : R/W; bitpos: [2]; default: 0;
 *  Configures lp_ana_peri registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_LP_ANA_PERI    (BIT(2))
#define LP_TEE_READ_REE1_LP_ANA_PERI_M  (LP_TEE_READ_REE1_LP_ANA_PERI_V << LP_TEE_READ_REE1_LP_ANA_PERI_S)
#define LP_TEE_READ_REE1_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_READ_REE1_LP_ANA_PERI_S  2
/** LP_TEE_READ_REE2_LP_ANA_PERI : R/W; bitpos: [3]; default: 0;
 *  Configures lp_ana_peri registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_LP_ANA_PERI    (BIT(3))
#define LP_TEE_READ_REE2_LP_ANA_PERI_M  (LP_TEE_READ_REE2_LP_ANA_PERI_V << LP_TEE_READ_REE2_LP_ANA_PERI_S)
#define LP_TEE_READ_REE2_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_READ_REE2_LP_ANA_PERI_S  3
/** LP_TEE_WRITE_TEE_LP_ANA_PERI : R/W; bitpos: [4]; default: 1;
 *  Configures lp_ana_peri registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_LP_ANA_PERI    (BIT(4))
#define LP_TEE_WRITE_TEE_LP_ANA_PERI_M  (LP_TEE_WRITE_TEE_LP_ANA_PERI_V << LP_TEE_WRITE_TEE_LP_ANA_PERI_S)
#define LP_TEE_WRITE_TEE_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_WRITE_TEE_LP_ANA_PERI_S  4
/** LP_TEE_WRITE_REE0_LP_ANA_PERI : R/W; bitpos: [5]; default: 0;
 *  Configures lp_ana_peri registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_LP_ANA_PERI    (BIT(5))
#define LP_TEE_WRITE_REE0_LP_ANA_PERI_M  (LP_TEE_WRITE_REE0_LP_ANA_PERI_V << LP_TEE_WRITE_REE0_LP_ANA_PERI_S)
#define LP_TEE_WRITE_REE0_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_WRITE_REE0_LP_ANA_PERI_S  5
/** LP_TEE_WRITE_REE1_LP_ANA_PERI : R/W; bitpos: [6]; default: 0;
 *  Configures lp_ana_peri registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_LP_ANA_PERI    (BIT(6))
#define LP_TEE_WRITE_REE1_LP_ANA_PERI_M  (LP_TEE_WRITE_REE1_LP_ANA_PERI_V << LP_TEE_WRITE_REE1_LP_ANA_PERI_S)
#define LP_TEE_WRITE_REE1_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_WRITE_REE1_LP_ANA_PERI_S  6
/** LP_TEE_WRITE_REE2_LP_ANA_PERI : R/W; bitpos: [7]; default: 0;
 *  Configures lp_ana_peri registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_LP_ANA_PERI    (BIT(7))
#define LP_TEE_WRITE_REE2_LP_ANA_PERI_M  (LP_TEE_WRITE_REE2_LP_ANA_PERI_V << LP_TEE_WRITE_REE2_LP_ANA_PERI_S)
#define LP_TEE_WRITE_REE2_LP_ANA_PERI_V  0x00000001U
#define LP_TEE_WRITE_REE2_LP_ANA_PERI_S  7

/** LP_TEE_LP_TOUCH_CTRL_REG register
 *  lp_touch read/write control register
 */
#define LP_TEE_LP_TOUCH_CTRL_REG (DR_REG_LP_TEE_BASE + 0x24)
/** LP_TEE_READ_TEE_LP_TOUCH : R/W; bitpos: [0]; default: 1;
 *  Configures lp_touch registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_LP_TOUCH    (BIT(0))
#define LP_TEE_READ_TEE_LP_TOUCH_M  (LP_TEE_READ_TEE_LP_TOUCH_V << LP_TEE_READ_TEE_LP_TOUCH_S)
#define LP_TEE_READ_TEE_LP_TOUCH_V  0x00000001U
#define LP_TEE_READ_TEE_LP_TOUCH_S  0
/** LP_TEE_READ_REE0_LP_TOUCH : R/W; bitpos: [1]; default: 0;
 *  Configures lp_touch registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_LP_TOUCH    (BIT(1))
#define LP_TEE_READ_REE0_LP_TOUCH_M  (LP_TEE_READ_REE0_LP_TOUCH_V << LP_TEE_READ_REE0_LP_TOUCH_S)
#define LP_TEE_READ_REE0_LP_TOUCH_V  0x00000001U
#define LP_TEE_READ_REE0_LP_TOUCH_S  1
/** LP_TEE_READ_REE1_LP_TOUCH : R/W; bitpos: [2]; default: 0;
 *  Configures lp_touch registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_LP_TOUCH    (BIT(2))
#define LP_TEE_READ_REE1_LP_TOUCH_M  (LP_TEE_READ_REE1_LP_TOUCH_V << LP_TEE_READ_REE1_LP_TOUCH_S)
#define LP_TEE_READ_REE1_LP_TOUCH_V  0x00000001U
#define LP_TEE_READ_REE1_LP_TOUCH_S  2
/** LP_TEE_READ_REE2_LP_TOUCH : R/W; bitpos: [3]; default: 0;
 *  Configures lp_touch registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_LP_TOUCH    (BIT(3))
#define LP_TEE_READ_REE2_LP_TOUCH_M  (LP_TEE_READ_REE2_LP_TOUCH_V << LP_TEE_READ_REE2_LP_TOUCH_S)
#define LP_TEE_READ_REE2_LP_TOUCH_V  0x00000001U
#define LP_TEE_READ_REE2_LP_TOUCH_S  3
/** LP_TEE_WRITE_TEE_LP_TOUCH : R/W; bitpos: [4]; default: 1;
 *  Configures lp_touch registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_LP_TOUCH    (BIT(4))
#define LP_TEE_WRITE_TEE_LP_TOUCH_M  (LP_TEE_WRITE_TEE_LP_TOUCH_V << LP_TEE_WRITE_TEE_LP_TOUCH_S)
#define LP_TEE_WRITE_TEE_LP_TOUCH_V  0x00000001U
#define LP_TEE_WRITE_TEE_LP_TOUCH_S  4
/** LP_TEE_WRITE_REE0_LP_TOUCH : R/W; bitpos: [5]; default: 0;
 *  Configures lp_touch registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_LP_TOUCH    (BIT(5))
#define LP_TEE_WRITE_REE0_LP_TOUCH_M  (LP_TEE_WRITE_REE0_LP_TOUCH_V << LP_TEE_WRITE_REE0_LP_TOUCH_S)
#define LP_TEE_WRITE_REE0_LP_TOUCH_V  0x00000001U
#define LP_TEE_WRITE_REE0_LP_TOUCH_S  5
/** LP_TEE_WRITE_REE1_LP_TOUCH : R/W; bitpos: [6]; default: 0;
 *  Configures lp_touch registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_LP_TOUCH    (BIT(6))
#define LP_TEE_WRITE_REE1_LP_TOUCH_M  (LP_TEE_WRITE_REE1_LP_TOUCH_V << LP_TEE_WRITE_REE1_LP_TOUCH_S)
#define LP_TEE_WRITE_REE1_LP_TOUCH_V  0x00000001U
#define LP_TEE_WRITE_REE1_LP_TOUCH_S  6
/** LP_TEE_WRITE_REE2_LP_TOUCH : R/W; bitpos: [7]; default: 0;
 *  Configures lp_touch registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_LP_TOUCH    (BIT(7))
#define LP_TEE_WRITE_REE2_LP_TOUCH_M  (LP_TEE_WRITE_REE2_LP_TOUCH_V << LP_TEE_WRITE_REE2_LP_TOUCH_S)
#define LP_TEE_WRITE_REE2_LP_TOUCH_V  0x00000001U
#define LP_TEE_WRITE_REE2_LP_TOUCH_S  7

