espressif/esp-idf/components/soc/esp32h4/register/soc/lp_tee_reg.h
/** LP_TEE_TOUCH_AON_CTRL_REG register
 *  touch_aon read/write control register
 */
#define LP_TEE_TOUCH_AON_CTRL_REG (DR_REG_LP_TEE_BASE + 0x28)
/** LP_TEE_READ_TEE_TOUCH_AON : R/W; bitpos: [0]; default: 1;
 *  Configures touch_aon registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_TOUCH_AON    (BIT(0))
#define LP_TEE_READ_TEE_TOUCH_AON_M  (LP_TEE_READ_TEE_TOUCH_AON_V << LP_TEE_READ_TEE_TOUCH_AON_S)
#define LP_TEE_READ_TEE_TOUCH_AON_V  0x00000001U
#define LP_TEE_READ_TEE_TOUCH_AON_S  0
/** LP_TEE_READ_REE0_TOUCH_AON : R/W; bitpos: [1]; default: 0;
 *  Configures touch_aon registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_TOUCH_AON    (BIT(1))
#define LP_TEE_READ_REE0_TOUCH_AON_M  (LP_TEE_READ_REE0_TOUCH_AON_V << LP_TEE_READ_REE0_TOUCH_AON_S)
#define LP_TEE_READ_REE0_TOUCH_AON_V  0x00000001U
#define LP_TEE_READ_REE0_TOUCH_AON_S  1
/** LP_TEE_READ_REE1_TOUCH_AON : R/W; bitpos: [2]; default: 0;
 *  Configures touch_aon registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_TOUCH_AON    (BIT(2))
#define LP_TEE_READ_REE1_TOUCH_AON_M  (LP_TEE_READ_REE1_TOUCH_AON_V << LP_TEE_READ_REE1_TOUCH_AON_S)
#define LP_TEE_READ_REE1_TOUCH_AON_V  0x00000001U
#define LP_TEE_READ_REE1_TOUCH_AON_S  2
/** LP_TEE_READ_REE2_TOUCH_AON : R/W; bitpos: [3]; default: 0;
 *  Configures touch_aon registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_TOUCH_AON    (BIT(3))
#define LP_TEE_READ_REE2_TOUCH_AON_M  (LP_TEE_READ_REE2_TOUCH_AON_V << LP_TEE_READ_REE2_TOUCH_AON_S)
#define LP_TEE_READ_REE2_TOUCH_AON_V  0x00000001U
#define LP_TEE_READ_REE2_TOUCH_AON_S  3
/** LP_TEE_WRITE_TEE_TOUCH_AON : R/W; bitpos: [4]; default: 1;
 *  Configures touch_aon registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_TOUCH_AON    (BIT(4))
#define LP_TEE_WRITE_TEE_TOUCH_AON_M  (LP_TEE_WRITE_TEE_TOUCH_AON_V << LP_TEE_WRITE_TEE_TOUCH_AON_S)
#define LP_TEE_WRITE_TEE_TOUCH_AON_V  0x00000001U
#define LP_TEE_WRITE_TEE_TOUCH_AON_S  4
/** LP_TEE_WRITE_REE0_TOUCH_AON : R/W; bitpos: [5]; default: 0;
 *  Configures touch_aon registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_TOUCH_AON    (BIT(5))
#define LP_TEE_WRITE_REE0_TOUCH_AON_M  (LP_TEE_WRITE_REE0_TOUCH_AON_V << LP_TEE_WRITE_REE0_TOUCH_AON_S)
#define LP_TEE_WRITE_REE0_TOUCH_AON_V  0x00000001U
#define LP_TEE_WRITE_REE0_TOUCH_AON_S  5
/** LP_TEE_WRITE_REE1_TOUCH_AON : R/W; bitpos: [6]; default: 0;
 *  Configures touch_aon registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_TOUCH_AON    (BIT(6))
#define LP_TEE_WRITE_REE1_TOUCH_AON_M  (LP_TEE_WRITE_REE1_TOUCH_AON_V << LP_TEE_WRITE_REE1_TOUCH_AON_S)
#define LP_TEE_WRITE_REE1_TOUCH_AON_V  0x00000001U
#define LP_TEE_WRITE_REE1_TOUCH_AON_S  6
/** LP_TEE_WRITE_REE2_TOUCH_AON : R/W; bitpos: [7]; default: 0;
 *  Configures touch_aon registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_TOUCH_AON    (BIT(7))
#define LP_TEE_WRITE_REE2_TOUCH_AON_M  (LP_TEE_WRITE_REE2_TOUCH_AON_V << LP_TEE_WRITE_REE2_TOUCH_AON_S)
#define LP_TEE_WRITE_REE2_TOUCH_AON_V  0x00000001U
#define LP_TEE_WRITE_REE2_TOUCH_AON_S  7

/** LP_TEE_LP_IO_CTRL_REG register
 *  lp_io read/write control register
 */
#define LP_TEE_LP_IO_CTRL_REG (DR_REG_LP_TEE_BASE + 0x2c)
/** LP_TEE_READ_TEE_LP_IO : R/W; bitpos: [0]; default: 1;
 *  Configures lp_io registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_LP_IO    (BIT(0))
#define LP_TEE_READ_TEE_LP_IO_M  (LP_TEE_READ_TEE_LP_IO_V << LP_TEE_READ_TEE_LP_IO_S)
#define LP_TEE_READ_TEE_LP_IO_V  0x00000001U
#define LP_TEE_READ_TEE_LP_IO_S  0
/** LP_TEE_READ_REE0_LP_IO : R/W; bitpos: [1]; default: 0;
 *  Configures lp_io registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_LP_IO    (BIT(1))
#define LP_TEE_READ_REE0_LP_IO_M  (LP_TEE_READ_REE0_LP_IO_V << LP_TEE_READ_REE0_LP_IO_S)
#define LP_TEE_READ_REE0_LP_IO_V  0x00000001U
#define LP_TEE_READ_REE0_LP_IO_S  1
/** LP_TEE_READ_REE1_LP_IO : R/W; bitpos: [2]; default: 0;
 *  Configures lp_io registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_LP_IO    (BIT(2))
#define LP_TEE_READ_REE1_LP_IO_M  (LP_TEE_READ_REE1_LP_IO_V << LP_TEE_READ_REE1_LP_IO_S)
#define LP_TEE_READ_REE1_LP_IO_V  0x00000001U
#define LP_TEE_READ_REE1_LP_IO_S  2
/** LP_TEE_READ_REE2_LP_IO : R/W; bitpos: [3]; default: 0;
 *  Configures lp_io registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_LP_IO    (BIT(3))
#define LP_TEE_READ_REE2_LP_IO_M  (LP_TEE_READ_REE2_LP_IO_V << LP_TEE_READ_REE2_LP_IO_S)
#define LP_TEE_READ_REE2_LP_IO_V  0x00000001U
#define LP_TEE_READ_REE2_LP_IO_S  3
/** LP_TEE_WRITE_TEE_LP_IO : R/W; bitpos: [4]; default: 1;
 *  Configures lp_io registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_LP_IO    (BIT(4))
#define LP_TEE_WRITE_TEE_LP_IO_M  (LP_TEE_WRITE_TEE_LP_IO_V << LP_TEE_WRITE_TEE_LP_IO_S)
#define LP_TEE_WRITE_TEE_LP_IO_V  0x00000001U
#define LP_TEE_WRITE_TEE_LP_IO_S  4
/** LP_TEE_WRITE_REE0_LP_IO : R/W; bitpos: [5]; default: 0;
 *  Configures lp_io registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_LP_IO    (BIT(5))
#define LP_TEE_WRITE_REE0_LP_IO_M  (LP_TEE_WRITE_REE0_LP_IO_V << LP_TEE_WRITE_REE0_LP_IO_S)
#define LP_TEE_WRITE_REE0_LP_IO_V  0x00000001U
#define LP_TEE_WRITE_REE0_LP_IO_S  5
/** LP_TEE_WRITE_REE1_LP_IO : R/W; bitpos: [6]; default: 0;
 *  Configures lp_io registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_LP_IO    (BIT(6))
#define LP_TEE_WRITE_REE1_LP_IO_M  (LP_TEE_WRITE_REE1_LP_IO_V << LP_TEE_WRITE_REE1_LP_IO_S)
#define LP_TEE_WRITE_REE1_LP_IO_V  0x00000001U
#define LP_TEE_WRITE_REE1_LP_IO_S  6
/** LP_TEE_WRITE_REE2_LP_IO : R/W; bitpos: [7]; default: 0;
 *  Configures lp_io registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_LP_IO    (BIT(7))
#define LP_TEE_WRITE_REE2_LP_IO_M  (LP_TEE_WRITE_REE2_LP_IO_V << LP_TEE_WRITE_REE2_LP_IO_S)
#define LP_TEE_WRITE_REE2_LP_IO_V  0x00000001U
#define LP_TEE_WRITE_REE2_LP_IO_S  7

/** LP_TEE_LP_BLE_TIMER_CTRL_REG register
 *  lp_ble_timer read/write control register
 */
#define LP_TEE_LP_BLE_TIMER_CTRL_REG (DR_REG_LP_TEE_BASE + 0x30)
/** LP_TEE_READ_TEE_LP_BLE_TIMER : R/W; bitpos: [0]; default: 1;
 *  Configures lp_ble_timer registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_LP_BLE_TIMER    (BIT(0))
#define LP_TEE_READ_TEE_LP_BLE_TIMER_M  (LP_TEE_READ_TEE_LP_BLE_TIMER_V << LP_TEE_READ_TEE_LP_BLE_TIMER_S)
#define LP_TEE_READ_TEE_LP_BLE_TIMER_V  0x00000001U
#define LP_TEE_READ_TEE_LP_BLE_TIMER_S  0
/** LP_TEE_READ_REE0_LP_BLE_TIMER : R/W; bitpos: [1]; default: 0;
 *  Configures lp_ble_timer registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_LP_BLE_TIMER    (BIT(1))
#define LP_TEE_READ_REE0_LP_BLE_TIMER_M  (LP_TEE_READ_REE0_LP_BLE_TIMER_V << LP_TEE_READ_REE0_LP_BLE_TIMER_S)
#define LP_TEE_READ_REE0_LP_BLE_TIMER_V  0x00000001U
#define LP_TEE_READ_REE0_LP_BLE_TIMER_S  1
/** LP_TEE_READ_REE1_LP_BLE_TIMER : R/W; bitpos: [2]; default: 0;
 *  Configures lp_ble_timer registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_LP_BLE_TIMER    (BIT(2))
#define LP_TEE_READ_REE1_LP_BLE_TIMER_M  (LP_TEE_READ_REE1_LP_BLE_TIMER_V << LP_TEE_READ_REE1_LP_BLE_TIMER_S)
#define LP_TEE_READ_REE1_LP_BLE_TIMER_V  0x00000001U
#define LP_TEE_READ_REE1_LP_BLE_TIMER_S  2
/** LP_TEE_READ_REE2_LP_BLE_TIMER : R/W; bitpos: [3]; default: 0;
 *  Configures lp_ble_timer registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_LP_BLE_TIMER    (BIT(3))
#define LP_TEE_READ_REE2_LP_BLE_TIMER_M  (LP_TEE_READ_REE2_LP_BLE_TIMER_V << LP_TEE_READ_REE2_LP_BLE_TIMER_S)
#define LP_TEE_READ_REE2_LP_BLE_TIMER_V  0x00000001U
#define LP_TEE_READ_REE2_LP_BLE_TIMER_S  3
/** LP_TEE_WRITE_TEE_LP_BLE_TIMER : R/W; bitpos: [4]; default: 1;
 *  Configures lp_ble_timer registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_LP_BLE_TIMER    (BIT(4))
#define LP_TEE_WRITE_TEE_LP_BLE_TIMER_M  (LP_TEE_WRITE_TEE_LP_BLE_TIMER_V << LP_TEE_WRITE_TEE_LP_BLE_TIMER_S)
#define LP_TEE_WRITE_TEE_LP_BLE_TIMER_V  0x00000001U
#define LP_TEE_WRITE_TEE_LP_BLE_TIMER_S  4
/** LP_TEE_WRITE_REE0_LP_BLE_TIMER : R/W; bitpos: [5]; default: 0;
 *  Configures lp_ble_timer registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_LP_BLE_TIMER    (BIT(5))
#define LP_TEE_WRITE_REE0_LP_BLE_TIMER_M  (LP_TEE_WRITE_REE0_LP_BLE_TIMER_V << LP_TEE_WRITE_REE0_LP_BLE_TIMER_S)
#define LP_TEE_WRITE_REE0_LP_BLE_TIMER_V  0x00000001U
#define LP_TEE_WRITE_REE0_LP_BLE_TIMER_S  5
/** LP_TEE_WRITE_REE1_LP_BLE_TIMER : R/W; bitpos: [6]; default: 0;
 *  Configures lp_ble_timer registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_LP_BLE_TIMER    (BIT(6))
#define LP_TEE_WRITE_REE1_LP_BLE_TIMER_M  (LP_TEE_WRITE_REE1_LP_BLE_TIMER_V << LP_TEE_WRITE_REE1_LP_BLE_TIMER_S)
#define LP_TEE_WRITE_REE1_LP_BLE_TIMER_V  0x00000001U
#define LP_TEE_WRITE_REE1_LP_BLE_TIMER_S  6
/** LP_TEE_WRITE_REE2_LP_BLE_TIMER : R/W; bitpos: [7]; default: 0;
 *  Configures lp_ble_timer registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_LP_BLE_TIMER    (BIT(7))
#define LP_TEE_WRITE_REE2_LP_BLE_TIMER_M  (LP_TEE_WRITE_REE2_LP_BLE_TIMER_V << LP_TEE_WRITE_REE2_LP_BLE_TIMER_S)
#define LP_TEE_WRITE_REE2_LP_BLE_TIMER_V  0x00000001U
#define LP_TEE_WRITE_REE2_LP_BLE_TIMER_S  7

/** LP_TEE_LP_TEE_CTRL_REG register
 *  lp_tee read/write control register
 */
#define LP_TEE_LP_TEE_CTRL_REG (DR_REG_LP_TEE_BASE + 0x34)
/** LP_TEE_READ_TEE_LP_TEE : R/W; bitpos: [0]; default: 1;
 *  Configures lp_tee registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_LP_TEE    (BIT(0))
#define LP_TEE_READ_TEE_LP_TEE_M  (LP_TEE_READ_TEE_LP_TEE_V << LP_TEE_READ_TEE_LP_TEE_S)
#define LP_TEE_READ_TEE_LP_TEE_V  0x00000001U
#define LP_TEE_READ_TEE_LP_TEE_S  0
/** LP_TEE_READ_REE0_LP_TEE : HRO; bitpos: [1]; default: 0;
 *  Configures lp_tee registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_LP_TEE    (BIT(1))
#define LP_TEE_READ_REE0_LP_TEE_M  (LP_TEE_READ_REE0_LP_TEE_V << LP_TEE_READ_REE0_LP_TEE_S)
#define LP_TEE_READ_REE0_LP_TEE_V  0x00000001U
#define LP_TEE_READ_REE0_LP_TEE_S  1
/** LP_TEE_READ_REE1_LP_TEE : HRO; bitpos: [2]; default: 0;
 *  Configures lp_tee registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_LP_TEE    (BIT(2))
#define LP_TEE_READ_REE1_LP_TEE_M  (LP_TEE_READ_REE1_LP_TEE_V << LP_TEE_READ_REE1_LP_TEE_S)
#define LP_TEE_READ_REE1_LP_TEE_V  0x00000001U
#define LP_TEE_READ_REE1_LP_TEE_S  2
/** LP_TEE_READ_REE2_LP_TEE : HRO; bitpos: [3]; default: 0;
 *  Configures lp_tee registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_LP_TEE    (BIT(3))
#define LP_TEE_READ_REE2_LP_TEE_M  (LP_TEE_READ_REE2_LP_TEE_V << LP_TEE_READ_REE2_LP_TEE_S)
#define LP_TEE_READ_REE2_LP_TEE_V  0x00000001U
#define LP_TEE_READ_REE2_LP_TEE_S  3
/** LP_TEE_WRITE_TEE_LP_TEE : R/W; bitpos: [4]; default: 1;
 *  Configures lp_tee registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_LP_TEE    (BIT(4))
#define LP_TEE_WRITE_TEE_LP_TEE_M  (LP_TEE_WRITE_TEE_LP_TEE_V << LP_TEE_WRITE_TEE_LP_TEE_S)
#define LP_TEE_WRITE_TEE_LP_TEE_V  0x00000001U
#define LP_TEE_WRITE_TEE_LP_TEE_S  4
/** LP_TEE_WRITE_REE0_LP_TEE : HRO; bitpos: [5]; default: 0;
 *  Configures lp_tee registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_LP_TEE    (BIT(5))
#define LP_TEE_WRITE_REE0_LP_TEE_M  (LP_TEE_WRITE_REE0_LP_TEE_V << LP_TEE_WRITE_REE0_LP_TEE_S)
#define LP_TEE_WRITE_REE0_LP_TEE_V  0x00000001U
#define LP_TEE_WRITE_REE0_LP_TEE_S  5
/** LP_TEE_WRITE_REE1_LP_TEE : HRO; bitpos: [6]; default: 0;
 *  Configures lp_tee registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_LP_TEE    (BIT(6))
#define LP_TEE_WRITE_REE1_LP_TEE_M  (LP_TEE_WRITE_REE1_LP_TEE_V << LP_TEE_WRITE_REE1_LP_TEE_S)
#define LP_TEE_WRITE_REE1_LP_TEE_V  0x00000001U
#define LP_TEE_WRITE_REE1_LP_TEE_S  6
/** LP_TEE_WRITE_REE2_LP_TEE : HRO; bitpos: [7]; default: 0;
 *  Configures lp_tee registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_LP_TEE    (BIT(7))
#define LP_TEE_WRITE_REE2_LP_TEE_M  (LP_TEE_WRITE_REE2_LP_TEE_V << LP_TEE_WRITE_REE2_LP_TEE_S)
#define LP_TEE_WRITE_REE2_LP_TEE_V  0x00000001U
#define LP_TEE_WRITE_REE2_LP_TEE_S  7

