espressif/esp-idf/components/soc/esp32h4/register/soc/lp_tee_reg.h
/** LP_TEE_HUK_CTRL_REG register
 *  lp_tee read/write control register
 */
#define LP_TEE_HUK_CTRL_REG (DR_REG_LP_TEE_BASE + 0x38)
/** LP_TEE_READ_TEE_HUK : R/W; bitpos: [0]; default: 1;
 *  Configures huk registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_TEE_HUK    (BIT(0))
#define LP_TEE_READ_TEE_HUK_M  (LP_TEE_READ_TEE_HUK_V << LP_TEE_READ_TEE_HUK_S)
#define LP_TEE_READ_TEE_HUK_V  0x00000001U
#define LP_TEE_READ_TEE_HUK_S  0
/** LP_TEE_READ_REE0_HUK : R/W; bitpos: [1]; default: 0;
 *  Configures huk registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE0_HUK    (BIT(1))
#define LP_TEE_READ_REE0_HUK_M  (LP_TEE_READ_REE0_HUK_V << LP_TEE_READ_REE0_HUK_S)
#define LP_TEE_READ_REE0_HUK_V  0x00000001U
#define LP_TEE_READ_REE0_HUK_S  1
/** LP_TEE_READ_REE1_HUK : R/W; bitpos: [2]; default: 0;
 *  Configures huk registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE1_HUK    (BIT(2))
#define LP_TEE_READ_REE1_HUK_M  (LP_TEE_READ_REE1_HUK_V << LP_TEE_READ_REE1_HUK_S)
#define LP_TEE_READ_REE1_HUK_V  0x00000001U
#define LP_TEE_READ_REE1_HUK_S  2
/** LP_TEE_READ_REE2_HUK : R/W; bitpos: [3]; default: 0;
 *  Configures huk registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_TEE_READ_REE2_HUK    (BIT(3))
#define LP_TEE_READ_REE2_HUK_M  (LP_TEE_READ_REE2_HUK_V << LP_TEE_READ_REE2_HUK_S)
#define LP_TEE_READ_REE2_HUK_V  0x00000001U
#define LP_TEE_READ_REE2_HUK_S  3
/** LP_TEE_WRITE_TEE_HUK : R/W; bitpos: [4]; default: 1;
 *  Configures huk registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_TEE_HUK    (BIT(4))
#define LP_TEE_WRITE_TEE_HUK_M  (LP_TEE_WRITE_TEE_HUK_V << LP_TEE_WRITE_TEE_HUK_S)
#define LP_TEE_WRITE_TEE_HUK_V  0x00000001U
#define LP_TEE_WRITE_TEE_HUK_S  4
/** LP_TEE_WRITE_REE0_HUK : R/W; bitpos: [5]; default: 0;
 *  Configures huk registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE0_HUK    (BIT(5))
#define LP_TEE_WRITE_REE0_HUK_M  (LP_TEE_WRITE_REE0_HUK_V << LP_TEE_WRITE_REE0_HUK_S)
#define LP_TEE_WRITE_REE0_HUK_V  0x00000001U
#define LP_TEE_WRITE_REE0_HUK_S  5
/** LP_TEE_WRITE_REE1_HUK : R/W; bitpos: [6]; default: 0;
 *  Configures huk registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE1_HUK    (BIT(6))
#define LP_TEE_WRITE_REE1_HUK_M  (LP_TEE_WRITE_REE1_HUK_V << LP_TEE_WRITE_REE1_HUK_S)
#define LP_TEE_WRITE_REE1_HUK_V  0x00000001U
#define LP_TEE_WRITE_REE1_HUK_S  6
/** LP_TEE_WRITE_REE2_HUK : R/W; bitpos: [7]; default: 0;
 *  Configures huk registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_TEE_WRITE_REE2_HUK    (BIT(7))
#define LP_TEE_WRITE_REE2_HUK_M  (LP_TEE_WRITE_REE2_HUK_V << LP_TEE_WRITE_REE2_HUK_S)
#define LP_TEE_WRITE_REE2_HUK_V  0x00000001U
#define LP_TEE_WRITE_REE2_HUK_S  7

/** LP_TEE_LP_GPIO_SECURITY_REG register
 *  need des
 */
#define LP_TEE_LP_GPIO_SECURITY_REG (DR_REG_LP_TEE_BASE + 0xe4)
/** LP_TEE_LP_GPIO_LOCK : R/W; bitpos: [5:0]; default: 0;
 *  This field decides whether lp_gpio_config can be locked, or not. 0 (default):
 *  unlocked. 1: locked.
 */
#define LP_TEE_LP_GPIO_LOCK    0x0000003FU
#define LP_TEE_LP_GPIO_LOCK_M  (LP_TEE_LP_GPIO_LOCK_V << LP_TEE_LP_GPIO_LOCK_S)
#define LP_TEE_LP_GPIO_LOCK_V  0x0000003FU
#define LP_TEE_LP_GPIO_LOCK_S  0

/** LP_TEE_HP_GPIO_SECURITY_1_REG register
 *  need des
 */
#define LP_TEE_HP_GPIO_SECURITY_1_REG (DR_REG_LP_TEE_BASE + 0xe8)
/** LP_TEE_HP_GPIO_LOCK_P1 : R/W; bitpos: [31:0]; default: 0;
 *  This field decides whether hp_gpio_config of PIN0~31 can be locked, or not. 0
 *  (default): unlocked. 1: locked.
 */
#define LP_TEE_HP_GPIO_LOCK_P1    0xFFFFFFFFU
#define LP_TEE_HP_GPIO_LOCK_P1_M  (LP_TEE_HP_GPIO_LOCK_P1_V << LP_TEE_HP_GPIO_LOCK_P1_S)
#define LP_TEE_HP_GPIO_LOCK_P1_V  0xFFFFFFFFU
#define LP_TEE_HP_GPIO_LOCK_P1_S  0

/** LP_TEE_HP_GPIO_SECURITY_2_REG register
 *  need des
 */
#define LP_TEE_HP_GPIO_SECURITY_2_REG (DR_REG_LP_TEE_BASE + 0xec)
/** LP_TEE_HP_GPIO_LOCK_P2 : R/W; bitpos: [7:0]; default: 0;
 *  This field decides whether hp_gpio_config of PIN32~39 can be locked, or not. 0
 *  (default): unlocked. 1: locked.
 */
#define LP_TEE_HP_GPIO_LOCK_P2    0x000000FFU
#define LP_TEE_HP_GPIO_LOCK_P2_M  (LP_TEE_HP_GPIO_LOCK_P2_V << LP_TEE_HP_GPIO_LOCK_P2_S)
#define LP_TEE_HP_GPIO_LOCK_P2_V  0x000000FFU
#define LP_TEE_HP_GPIO_LOCK_P2_S  0

/** LP_TEE_BUS_ERR_CONF_REG register
 *  Clock gating register
 */
#define LP_TEE_BUS_ERR_CONF_REG (DR_REG_LP_TEE_BASE + 0xf0)
/** LP_TEE_BUS_ERR_RESP_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether return error response to cpu when access blocked
 *  0: disable error response
 *  1: enable error response
 */
#define LP_TEE_BUS_ERR_RESP_EN    (BIT(0))
#define LP_TEE_BUS_ERR_RESP_EN_M  (LP_TEE_BUS_ERR_RESP_EN_V << LP_TEE_BUS_ERR_RESP_EN_S)
#define LP_TEE_BUS_ERR_RESP_EN_V  0x00000001U
#define LP_TEE_BUS_ERR_RESP_EN_S  0

/** LP_TEE_CLOCK_GATE_REG register
 *  Clock gating register
 */
#define LP_TEE_CLOCK_GATE_REG (DR_REG_LP_TEE_BASE + 0xf8)
/** LP_TEE_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: enable automatic clock gating
 *  1: keep the clock always on
 */
#define LP_TEE_CLK_EN    (BIT(0))
#define LP_TEE_CLK_EN_M  (LP_TEE_CLK_EN_V << LP_TEE_CLK_EN_S)
#define LP_TEE_CLK_EN_V  0x00000001U
#define LP_TEE_CLK_EN_S  0

/** LP_TEE_DATE_REG register
 *  Version control register
 */
#define LP_TEE_DATE_REG (DR_REG_LP_TEE_BASE + 0xfc)
/** LP_TEE_DATE : R/W; bitpos: [27:0]; default: 38813840;
 *  Version control register
 */
#define LP_TEE_DATE    0x0FFFFFFFU
#define LP_TEE_DATE_M  (LP_TEE_DATE_V << LP_TEE_DATE_S)
#define LP_TEE_DATE_V  0x0FFFFFFFU
#define LP_TEE_DATE_S  0

#ifdef __cplusplus
}
#endif
